package Exercises;

public class MarksAndTV {
    public static void main(String[] args) {
        /*
        Task 2 Реализовать с использованием switch
        Ваш ребенок принес оценку за контрольную работу по математике.
        В школе 12 бальная система. Запишите в переменную случайное число от 0 до 12.
        Вы разрешаете ребенку смотреть телевизор не более 60 минут в день. На сегодня у него осталось 45 минут. (записать в переменную)
        Если оценка от 10 до 12 баллов -> Скажите ему, как вы рады и добавьте к оставшемуся на сегодня времени 1 час от 7 до 9 -> Слова
         */

        // Шаг 1 - генерация случайного числа в интервале от 0 до 12
        // формула (генератор сл чисел), тип переменной, имя переменной (note)
        // выбор того, что можно сказать ребенку, как делать с Джава? - switch ... case


    }
}
